Autodesk.Revit.DB.Structure.AnalyticalElement.SetTransform(Autodesk.Revit.DB.Transform)
Sets the transform of Analytical Element Local Coordinate System.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The provided Local Coordinate System is not valid
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.AnalyticalElement.IsValidTransform(Autodesk.Revit.DB.Transform)
Checks whether the value set for Local Coordinate System is valid for an Analytical Element.
Remarks:
Origin should be equal with Origin from Autodesk.Revit.DB.Structure.AnalyticalElement.GetTransform
Z axis should be parallel with Analytical Element's plane.
X and Y axis should be in Analytical Element's plane.
For non-planar elements the X or Y axis should be tangent at transform origin.
trf:
The value set to be verified.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025